Show / Hide Table of Contents
Class RebarPolyLine3D
Represents a polyline in 3D space.
Inheritance
System.Object
OpenObject
RebarPolyLine3D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public class RebarPolyLine3D : OpenObject
Constructors
Improve this Doc   View Source
RebarPolyLine3D()
Constructor
Declaration
public RebarPolyLine3D()
Properties
Improve this Doc   View Source
Segments
Gets segments of RebarPolyLine3D.
Declaration
public List<RebarSegment3DBase> Segments { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarSegment3DBase>
Improve this Doc   View Source
StartPoint
Gets or sets the point where the RebarPolyLine3D begins.
Declaration
public RebarPoint3D StartPoint { get; set; }
Property Value
 Type |  Description
 RebarPoint3D
 Improve this Doc
 View Source